{"format": "graph-model", "generatedBy": "CouncilMed v3", "convertedBy": "CouncilMed Frozen Graph Exporter", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "input": [], "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/Conv1_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/bn_Conv1_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/bn_Conv1_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/bn_Conv1_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/bn_Conv1_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_pad_1/Const", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_pad_1/Const", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_5_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_pad_1/Const", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_6_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_7_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_8_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_9_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_10_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_11_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_12_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_pad_1/Const", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_13_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_14_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_expand_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_expand_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_expand_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_expand_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_expand_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_expand_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_depthwise_1/depthwise/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_depthwise_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_depthwise_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_depthwise_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_depthwise_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_depthwise_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_project_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_project_BN_1/Cast_1/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_project_BN_1/batchnorm/add/y", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_project_BN_1/Cast_2/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_project_BN_1/Cast_3/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_15_project_BN_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "AttentionNet_1/mobilenetv2_1.00_224_1/block_16_expand_1/convolution/ReadVariableOp/resource", "op": 