{"format": "graph-model", "generatedBy": "CouncilMed v3", "convertedBy": "CouncilMed Frozen Graph Exporter", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "input": [], "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/Reshape/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/Reshape/shape", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/conv2d_1_2/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/Reshape/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/Reshape/shape", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/conv2d_2_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/Reshape/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/Reshape/shape", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/conv2d_3_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/Reshape/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/Reshape/shape", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/conv2d_4_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/Reshape/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/Reshape/shape", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/dense_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/dense_1/BiasAdd/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_region_output_1/Cast/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_region_output_1/BiasAdd/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/Reshape/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/convolution/ReadVariableOp/resource", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/Reshape/shape", "op": "Const", "input": [], "attr": {"dtype": {"type": "DT_INT32"}}}, {"name": "Segmenter_1/conv2d_1/convolution/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_1/convolution/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/convolution", "op": "Conv2D", "input": ["x", "Segmenter_1/conv2d_1/convolution/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "SAME"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "NHWC"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Segmenter_1/conv2d_1/Reshape/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_1/Reshape/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/Reshape", "op": "Reshape", "input": ["Segmenter_1/conv2d_1/Reshape/ReadVariableOp", "Segmenter_1/conv2d_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/Squeeze", "op": "Squeeze", "input": ["Segmenter_1/conv2d_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/conv2d_1/convolution", "Segmenter_1/conv2d_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "NHWC"}}}, {"name": "Segmenter_1/conv2d_1/Relu", "op": "Relu", "input": ["Segmenter_1/conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_1_2/convolution/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/convolution", "op": "Conv2D", "input": ["Segmenter_1/conv2d_1/Relu", "Segmenter_1/conv2d_1_2/convolution/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "SAME"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "NHWC"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Segmenter_1/conv2d_1_2/Reshape/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_1_2/Reshape/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/Reshape", "op": "Reshape", "input": ["Segmenter_1/conv2d_1_2/Reshape/ReadVariableOp", "Segmenter_1/conv2d_1_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/Squeeze", "op": "Squeeze", "input": ["Segmenter_1/conv2d_1_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_1_2/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/conv2d_1_2/convolution", "Segmenter_1/conv2d_1_2/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "NHWC"}}}, {"name": "Segmenter_1/conv2d_1_2/Relu", "op": "Relu", "input": ["Segmenter_1/conv2d_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/convolution/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_2_1/convolution/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/convolution", "op": "Conv2D", "input": ["Segmenter_1/conv2d_1_2/Relu", "Segmenter_1/conv2d_2_1/convolution/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "SAME"}, "data_format": {"s": "NHWC"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Segmenter_1/conv2d_2_1/Reshape/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_2_1/Reshape/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/Reshape", "op": "Reshape", "input": ["Segmenter_1/conv2d_2_1/Reshape/ReadVariableOp", "Segmenter_1/conv2d_2_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/Squeeze", "op": "Squeeze", "input": ["Segmenter_1/conv2d_2_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_2_1/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/conv2d_2_1/convolution", "Segmenter_1/conv2d_2_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "NHWC"}}}, {"name": "Segmenter_1/conv2d_2_1/Relu", "op": "Relu", "input": ["Segmenter_1/conv2d_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/convolution/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_3_1/convolution/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/convolution", "op": "Conv2D", "input": ["Segmenter_1/conv2d_2_1/Relu", "Segmenter_1/conv2d_3_1/convolution/ReadVariableOp"], "attr": {"data_format": {"s": "NHWC"}, "padding": {"s": "SAME"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Segmenter_1/conv2d_3_1/Reshape/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_3_1/Reshape/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/Reshape", "op": "Reshape", "input": ["Segmenter_1/conv2d_3_1/Reshape/ReadVariableOp", "Segmenter_1/conv2d_3_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/Squeeze", "op": "Squeeze", "input": ["Segmenter_1/conv2d_3_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/conv2d_3_1/convolution", "Segmenter_1/conv2d_3_1/Squeeze"], "attr": {"data_format": {"s": "NHWC"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_3_1/Relu", "op": "Relu", "input": ["Segmenter_1/conv2d_3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/convolution/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_4_1/convolution/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/convolution", "op": "Conv2D", "input": ["Segmenter_1/conv2d_3_1/Relu", "Segmenter_1/conv2d_4_1/convolution/ReadVariableOp"], "attr": {"data_format": {"s": "NHWC"}, "padding": {"s": "SAME"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Segmenter_1/conv2d_4_1/Reshape/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/conv2d_4_1/Reshape/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/Reshape", "op": "Reshape", "input": ["Segmenter_1/conv2d_4_1/Reshape/ReadVariableOp", "Segmenter_1/conv2d_4_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/Squeeze", "op": "Squeeze", "input": ["Segmenter_1/conv2d_4_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/conv2d_4_1/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/conv2d_4_1/convolution", "Segmenter_1/conv2d_4_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "NHWC"}}}, {"name": "Segmenter_1/conv2d_4_1/Relu", "op": "Relu", "input": ["Segmenter_1/conv2d_4_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/global_average_pooling2d_1/Mean", "op": "Mean", "input": ["Segmenter_1/conv2d_4_1/Relu", "Segmenter_1/global_average_pooling2d_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "Segmenter_1/dense_1/Cast/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/dense_1/Cast/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/dense_1/MatMul", "op": "MatMul", "input": ["Segmenter_1/global_average_pooling2d_1/Mean", "Segmenter_1/dense_1/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Segmenter_1/dense_1/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/dense_1/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/dense_1/MatMul", "Segmenter_1/dense_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "NHWC"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/dense_1/Relu", "op": "Relu", "input": ["Segmenter_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_region_output_1/Cast/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/seg_region_output_1/Cast/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_region_output_1/MatMul", "op": "MatMul", "input": ["Segmenter_1/dense_1/Relu", "Segmenter_1/seg_region_output_1/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Segmenter_1/seg_region_output_1/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/seg_region_output_1/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_region_output_1/BiasAdd", "op": "BiasAdd", "input": ["Segmenter_1/seg_region_output_1/MatMul", "Segmenter_1/seg_region_output_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "NHWC"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_region_output_1/Softmax", "op": "Softmax", "input": ["Segmenter_1/seg_region_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/Reshape/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/seg_mask_output_1/Reshape/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/convolution/ReadVariableOp", "op": "Identity", "input": ["Segmenter_1/seg_mask_output_1/convolution/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Segmenter_1/conv2d_1/Reshape/ReadVariableOp", "^Segmenter_1/conv2d_1/convolution/ReadVariableOp", "^Segmenter_1/conv2d_1_2/Reshape/ReadVariableOp", "^Segmenter_1/conv2d_1_2/convolution/ReadVariableOp", "^Segmenter_1/conv2d_2_1/Reshape/ReadVariableOp", "^Segmenter_1/conv2d_2_1/convolution/ReadVariableOp", "^Segmenter_1/conv2d_3_1/Reshape/ReadVariableOp", "^Segmenter_1/conv2d_3_1/convolution/ReadVariableOp", "^Segmenter_1/conv2d_4_1/Reshape/ReadVariableOp", "^Segmenter_1/conv2d_4_1/convolution/ReadVariableOp", "^Segmenter_1/dense_1/BiasAdd/ReadVariableOp", "^Segmenter_1/dense_1/Cast/ReadVariableOp", "^Segmenter_1/seg_mask_output_1/Reshape/ReadVariableOp", "^Segmenter_1/seg_mask_output_1/convolution/ReadVariableOp", "^Segmenter_1/seg_region_output_1/BiasAdd/ReadVariableOp", "^Segmenter_1/seg_region_output_1/Cast/ReadVariableOp"]}, {"name": "Identity", "op": "Identity", "input": ["Segmenter_1/seg_region_output_1/Softmax", "^NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/convolution", "op": "Conv2D", "input": ["Segmenter_1/conv2d_4_1/Relu", "Segmenter_1/seg_mask_output_1/convolution/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VALID"}, "data_format": {"s": "NHWC"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Segmenter_1/seg_mask_output_1/Reshape", "op": "Reshape", "input": ["Segmenter_1/seg_mask_output_1/Reshape/ReadVariableOp", "Segmenter_1/seg_mask_output_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/Add", "op": "AddV2", "input": ["Segmenter_1/seg_mask_output_1/convolution", "Segmenter_1/seg_mask_output_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Segmenter_1/seg_mask_output_1/Sigmoid", "op": "Sigmoid", "input": ["Segmenter_1/seg_mask_output_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["Segmenter_1/seg_mask_output_1/Sigmoid", "^NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 1}}, "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"Identity": {"name": "Identity:0", "dtype": "DT_FLOAT"}, "Identity_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT"}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Segmenter_1/conv2d_1/convolution/ReadVariableOp/resource", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_1/Reshape/ReadVariableOp/resource", "shape": [32], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_1_2/convolution/ReadVariableOp/resource", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_1_2/Reshape/ReadVariableOp/resource", "shape": [64], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_2_1/convolution/ReadVariableOp/resource", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_2_1/Reshape/ReadVariableOp/resource", "shape": [128], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_3_1/convolution/ReadVariableOp/resource", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_3_1/Reshape/ReadVariableOp/resource", "shape": [256], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_4_1/convolution/ReadVariableOp/resource", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Segmenter_1/conv2d_4_1/Reshape/ReadVariableOp/resource", "shape": [256], "dtype": "float32"}, {"name": "Segmenter_1/dense_1/Cast/ReadVariableOp/resource", "shape": [256, 128], "dtype": "float32"}, {"name": "Segmenter_1/dense_1/BiasAdd/ReadVariableOp/resource", "shape": [128], "dtype": "float32"}, {"name": "Segmenter_1/seg_region_output_1/Cast/ReadVariableOp/resource", "shape": [128, 10], "dtype": "float32"}, {"name": "Segmenter_1/seg_region_output_1/BiasAdd/ReadVariableOp/resource", "shape": [10], "dtype": "float32"}, {"name": "Segmenter_1/seg_mask_output_1/Reshape/ReadVariableOp/resource", "shape": [1], "dtype": "float32"}, {"name": "Segmenter_1/seg_mask_output_1/convolution/ReadVariableOp/resource", "shape": [1, 1, 256, 1], "dtype": "float32"}]}]}